app/controllers/histories_controller.rb

  def index
    @histories = History.all
---
SELECT "histories".* FROM "histories"

    def set_history
      @history = History.find(params[:id])
---
SELECT  "histories".* FROM "histories" WHERE "histories"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]